In [ ]:
# 212~236 + 242~243 + 253~257

In [1]:
# 4.3.3 손실 데이터 처리
import pandas as pd
import numpy as np

d = {'one': [1.5, 2.2, -3.0], 'two': [1.0, -1.2, 5.0], 'three': [-1.1, 2.0, 4.0]}
df = pd.DataFrame(d, index=['a', 'c', 'f'])
df['four'] = 'ha'
df['five'] = df['one'] > 0
df

   one  two  three four   five
a  1.5  1.0   -1.1   ha   True
c  2.2 -1.2    2.0   ha   True
f -3.0  5.0    4.0   ha  False

In [2]:
df1 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f'])
df1

   one  two  three four   five
a  1.5  1.0   -1.1   ha   True
b  NaN  NaN    NaN  NaN    NaN
c  2.2 -1.2    2.0   ha   True
d  NaN  NaN    NaN  NaN    NaN
e  NaN  NaN    NaN  NaN    NaN
f -3.0  5.0    4.0   ha  False

In [3]:
df1['one']

a    1.5
b    NaN
c    2.2
d    NaN
e    NaN
f   -3.0
Name: one, dtype: float64

In [4]:
pd.isna(df1['one'])

a    False
b     True
c    False
d     True
e     True
f    False
Name: one, dtype: bool

In [5]:
df1['four'].notna()

a     True
b    False
c     True
d    False
e    False
f     True
Name: four, dtype: bool

In [6]:
None == None

True

In [7]:
np.nan == np.nan

False

In [8]:
# 손실 데이터 계산
d1 = {'one': [1.0, 2.0, 3.0], 'two': [4.0, 5.0, 6.0]}
df1 = pd.DataFrame(d1, index = ['a', 'b', 'c'])
df2 = df1.copy()
df2.loc['d'] = np.nan
df2['three'] = 2.0
df2.iloc[1:2, 1:2] = np.nan
df1

   one  two
a  1.0  4.0
b  2.0  5.0
c  3.0  6.0

In [9]:
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [10]:
df1 + df2

   one  three   two
a  2.0    NaN   8.0
b  4.0    NaN   NaN
c  6.0    NaN  12.0
d  NaN    NaN   NaN

In [11]:
pd.Series([np.nan]).sum()

0.0

In [12]:
pd.Series([], dtype=object).sum()

0

In [13]:
pd.Series([np.nan]).prod()

1.0

In [14]:
pd.Series([], dtype=object).prod()

1

In [15]:
# 손실 데이터 채우기

df2.fillna(0)

   one  two  three
a  1.0  4.0    2.0
b  2.0  0.0    2.0
c  3.0  6.0    2.0
d  0.0  0.0    2.0

In [16]:
df2['one'].fillna('missing')

a        1.0
b        2.0
c        3.0
d    missing
Name: one, dtype: object

In [17]:
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [18]:
df2.fillna(method='pad')

   one  two  three
a  1.0  4.0    2.0
b  2.0  4.0    2.0
c  3.0  6.0    2.0
d  3.0  6.0    2.0

In [19]:
df2.loc['c', 'three'] = np.nan

In [20]:
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    NaN
d  NaN  NaN    2.0

In [22]:
df2.mean()

one      2.0
two      5.0
three    2.0
dtype: float64

In [23]:
df2.fillna(df2.mean())

   one  two  three
a  1.0  4.0    2.0
b  2.0  5.0    2.0
c  3.0  6.0    2.0
d  2.0  5.0    2.0

In [26]:
df = pd.DataFrame([[np.nan, 2, 0, np.nan], [3, 4, np.nan, 1], [np.nan, 5, np.nan, 2],
                   [np.nan, 1, 2, 3]], columns = list('ABCD'))
df

     A  B    C    D
0  NaN  2  0.0  NaN
1  3.0  4  NaN  1.0
2  NaN  5  NaN  2.0
3  NaN  1  2.0  3.0

In [27]:
df.fillna(0)

     A  B    C    D
0  0.0  2  0.0  0.0
1  3.0  4  0.0  1.0
2  0.0  5  0.0  2.0
3  0.0  1  2.0  3.0

In [28]:
df.fillna(method = 'ffill')

     A  B    C    D
0  NaN  2  0.0  NaN
1  3.0  4  0.0  1.0
2  3.0  5  0.0  2.0
3  3.0  1  2.0  3.0

In [29]:
val = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=val)

     A  B    C    D
0  0.0  2  0.0  3.0
1  3.0  4  2.0  1.0
2  0.0  5  2.0  2.0
3  0.0  1  2.0  3.0

In [30]:
df.fillna(value=val, limit=1)

     A  B    C    D
0  0.0  2  0.0  3.0
1  3.0  4  2.0  1.0
2  NaN  5  NaN  2.0
3  NaN  1  2.0  3.0

In [31]:
df2.iloc[2:3, 2:3] = 2.0
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [32]:
df2.dropna(axis=0)

   one  two  three
a  1.0  4.0    2.0
c  3.0  6.0    2.0

In [33]:
df2.dropna(axis=1)

   three
a    2.0
b    2.0
c    2.0
d    2.0

In [34]:
df2['two'].dropna()

a    4.0
c    6.0
Name: two, dtype: float64

In [35]:
df = pd.DataFrame({'name': ['haena', 'suho', 'naeun'],
                   'hobby': ['jogging', 'reading', np.nan],
                  'born': [pd.NaT, pd.Timestamp('2001-01-01'), pd.NaT]})
df

    name    hobby       born
0  haena  jogging        NaT
1   suho  reading 2001-01-01
2  naeun      NaN        NaT

In [37]:
df.dropna()

   name    hobby       born
1  suho  reading 2001-01-01

In [39]:
df.dropna(axis='columns')

    name
0  haena
1   suho
2  naeun

In [40]:
df.dropna(how='all')

    name    hobby       born
0  haena  jogging        NaT
1   suho  reading 2001-01-01
2  naeun      NaN        NaT

In [41]:
df.dropna(thresh = 2)

    name    hobby       born
0  haena  jogging        NaT
1   suho  reading 2001-01-01

In [42]:
df.dropna(subset = ['name', 'born'])

   name    hobby       born
1  suho  reading 2001-01-01

In [44]:
df.dropna(inplace = True)
df

   name    hobby       born
1  suho  reading 2001-01-01

In [45]:
ser = pd.Series([0, np.nan, 2, 3, 5])
ser

0    0.0
1    NaN
2    2.0
3    3.0
4    5.0
dtype: float64

In [46]:
ser.replace(np.nan, 1.0)

0    0.0
1    1.0
2    2.0
3    3.0
4    5.0
dtype: float64

In [49]:
ser.replace({np.nan: 1, 5: 4})

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [50]:
ser.replace([0, 2], 1)

0    1.0
1    NaN
2    1.0
3    3.0
4    5.0
dtype: float64

In [51]:
ser.replace([np.nan, 5], [1, np.nan])

0    0.0
1    1.0
2    2.0
3    3.0
4    NaN
dtype: float64

In [52]:
df = pd.DataFrame({'A': [0, 1, np.nan], 'B': [3, 4, 5]})
df.replace({'A': np.nan, 'B': 3}, 10)

      A   B
0   0.0  10
1   1.0   4
2  10.0   5

In [54]:
# 4.3.4 멀티인덱스

li = [['ha', 'ha', 'hi', 'hi', 'ho', 'ho'], ['one', 'two', 'one', 'two', 'one', 'two']]
li1 = list(zip(*li))
li1

[('ha', 'one'),
 ('ha', 'two'),
 ('hi', 'one'),
 ('hi', 'two'),
 ('ho', 'one'),
 ('ho', 'two')]

In [55]:
ind = pd.MultiIndex.from_tuples(li1, names=['1st', '2nd'])
ind

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [56]:
ser = pd.Series(np.random.randn(6), index=ind)
ser

1st  2nd
ha   one    0.084728
     two   -0.179387
hi   one   -0.324190
     two    0.058003
ho   one   -2.006291
     two    0.266411
dtype: float64

In [57]:
iter = [['ha', 'hi', 'ho'], ['one', 'two']]
pd.MultiIndex.from_product(iter, names=['1st', '2nd'])

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [58]:
df = pd.DataFrame([['ha', 'one'], ['ha', 'two'], ['ho', 'one'], ['ho', 'two']],
                                                                 columns = ['1st', '2nd'])
pd.MultiIndex.from_frame(df)

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [59]:
arr = [np.array(['ha', 'ha', 'hi', 'hi', 'ho', 'ho']), np.array(['one', 'two', 'one',
                                                                 'two', 'one', 'two'])]
ser = pd.Series(np.random.randn(6), index=arr)
ser

ha  one    0.543135
    two   -0.602134
hi  one   -0.744668
    two    1.964872
ho  one    1.371068
    two   -0.519936
dtype: float64

In [60]:
df = pd.DataFrame(np.random.randn(6, 3), index=arr)
df

               0         1         2
ha one  0.501971 -1.797104 -0.104905
   two  1.526197 -0.329623  0.674479
hi one  1.051420 -0.755669 -0.992502
   two -0.152401 -1.853396  0.408253
ho one -0.703247  0.913650  0.645162
   two  0.631489  0.707708 -0.627036

In [61]:
df = pd.DataFrame(np.random.randn(3, 6), index = ['A', 'B', 'C'], columns = ind)
df

1st        ha                  hi                  ho
2nd       one       two       one       two       one       two
A    0.045153  0.326284 -0.724382 -1.180638  0.880138  1.194827
B   -1.970692 -0.024067  0.003469  1.264374  1.377679 -1.129651
C   -0.947458 -0.851646 -0.838114 -1.014734 -1.836602 -0.565644

In [62]:
# 멀티인덱스 인덱싱
df['ha']

2nd       one       two
A    0.045153  0.326284
B   -1.970692 -0.024067
C   -0.947458 -0.851646

In [63]:
df['ha']['one']

A    0.045153
B   -1.970692
C   -0.947458
Name: one, dtype: float64

In [64]:
ser.reindex(ind[:3])

1st  2nd
ha   one    0.543135
     two   -0.602134
hi   one   -0.744668
dtype: float64

In [65]:
ser.reindex([('ho', 'one'), ('ha', 'two')])

ho  one    1.371068
ha  two   -0.602134
dtype: float64

In [66]:
df = df.T
df

                A         B         C
1st 2nd
ha  one  0.045153 -1.970692 -0.947458
    two  0.326284 -0.024067 -0.851646
hi  one -0.724382  0.003469 -0.838114
    two -1.180638  1.264374 -1.014734
ho  one  0.880138  1.377679 -1.836602
    two  1.194827 -1.129651 -0.565644

In [67]:
df.loc[('ha', 'two')]

A    0.326284
B   -0.024067
C   -0.851646
Name: (ha, two), dtype: float64

In [68]:
df.loc[('ha', 'two'), 'A']
df.loc['ha']

            A         B         C
2nd
one  0.045153 -1.970692 -0.947458
two  0.326284 -0.024067 -0.851646

In [69]:
df.loc['ha':'hi']

                A         B         C
1st 2nd
ha  one  0.045153 -1.970692 -0.947458
    two  0.326284 -0.024067 -0.851646
hi  one -0.724382  0.003469 -0.838114
    two -1.180638  1.264374 -1.014734

In [70]:
df.loc[('hi', 'two'):('ho', 'one')]

                A         B         C
1st 2nd
hi  two -1.180638  1.264374 -1.014734
ho  one  0.880138  1.377679 -1.836602

In [71]:
df.loc[('hi', 'two'):'ho']

                A         B         C
1st 2nd
hi  two -1.180638  1.264374 -1.014734
ho  one  0.880138  1.377679 -1.836602
    two  1.194827 -1.129651 -0.565644

In [72]:
df.loc[[('ha', 'two'), ('ho', 'one')]]

                A         B         C
1st 2nd
ha  two  0.326284 -0.024067 -0.851646
ho  one  0.880138  1.377679 -1.836602

In [73]:
# 멀티인덱스 순서 정렬
li1

[('ha', 'one'),
 ('ha', 'two'),
 ('hi', 'one'),
 ('hi', 'two'),
 ('ho', 'one'),
 ('ho', 'two')]

In [74]:
np.random.shuffle(li1)

In [75]:
li1

[('ha', 'two'),
 ('ha', 'one'),
 ('ho', 'one'),
 ('hi', 'two'),
 ('ho', 'two'),
 ('hi', 'one')]

In [77]:
ser = pd.Series(np.random.randn(6), index = pd.MultiIndex.from_tuples(li1))
ser

ha  two   -0.865925
    one   -1.426396
ho  one   -0.614416
hi  two    0.448234
ho  two    0.393412
hi  one    0.087316
dtype: float64

In [79]:
ser.sort_index(level = 0)

ha  one   -1.426396
    two   -0.865925
hi  one    0.087316
    two    0.448234
ho  one   -0.614416
    two    0.393412
dtype: float64

In [80]:
ser.sort_index(level = 1)

ha  one   -1.426396
hi  one    0.087316
ho  one   -0.614416
ha  two   -0.865925
hi  two    0.448234
ho  two    0.393412
dtype: float64

In [82]:
ser.index.set_names(['1st', '2nd'], inplace = True)
ser.sort_index(level = '1st')

1st  2nd
ha   one   -1.426396
     two   -0.865925
hi   one    0.087316
     two    0.448234
ho   one   -0.614416
     two    0.393412
dtype: float64

In [83]:
ser.sort_index(level = '2nd')

1st  2nd
ha   one   -1.426396
hi   one    0.087316
ho   one   -0.614416
ha   two   -0.865925
hi   two    0.448234
ho   two    0.393412
dtype: float64

In [84]:
df

                A         B         C
1st 2nd
ha  one  0.045153 -1.970692 -0.947458
    two  0.326284 -0.024067 -0.851646
hi  one -0.724382  0.003469 -0.838114
    two -1.180638  1.264374 -1.014734
ho  one  0.880138  1.377679 -1.836602
    two  1.194827 -1.129651 -0.565644

In [85]:
df.T.sort_index(level = 1, axis = 1)

1st        ha        hi        ho        ha        hi        ho
2nd       one       one       one       two       two       two
A    0.045153 -0.724382  0.880138  0.326284 -1.180638  1.194827
B   -1.970692  0.003469  1.377679 -0.024067  1.264374 -1.129651
C   -0.947458 -0.838114 -1.836602 -0.851646 -1.014734 -0.565644

In [86]:
# 4.4 데이터 타입과 입출력
# 4.4.1 텍스트 파일

# csv 

data = {'name': ['haena', 'naeun', 'una', 'bum', 'suho'],
       'age': [30, 27, 28, 23, 18],
       'address': ['dogok', 'suwon', 'mapo', 'ilsan', 'yeoyi'],
       'grade': ['A', 'B', 'C', 'B', 'A'],
       'score': [100, 88, 73, 83, 95]}
df = pd.DataFrame(data, columns = ['name', 'age', 'address', 'score', 'grade'])
df

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [93]:
df.to_csv('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade.csv')

In [99]:
!type /Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade.csv

/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade.csv not found

In [101]:
df1 = pd.read_csv('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade.csv')
df1

   Unnamed: 0   name  age address  score grade
0           0  haena   30   dogok    100     A
1           1  naeun   27   suwon     88     B
2           2    una   28    mapo     73     C
3           3    bum   23   ilsan     83     B
4           4   suho   18   yeoyi     95     A

In [102]:
df1 = df1.iloc[0:5, 1:6]
df1

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [103]:
df.to_csv('student_grade.csv')

In [105]:
df2 = pd.read_csv('student_grade.csv', header=None, nrows=3)
df2

     0      1    2        3      4      5
0  NaN   name  age  address  score  grade
1  0.0  haena   30    dogok    100      A
2  1.0  naeun   27    suwon     88      B

In [106]:
df2 = pd.read_csv('student_grade.csv', index_col=0)
df2

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [107]:
df2 = pd.read_csv('student_grade.csv', index_col = ['name'])
df2

       Unnamed: 0  age address  score grade
name
haena           0   30   dogok    100     A
naeun           1   27   suwon     88     B
una             2   28    mapo     73     C
bum             3   23   ilsan     83     B
suho            4   18   yeoyi     95     A

In [109]:
df2 = pd.read_csv('student_grade.csv', names = ['No', 'name', 'age', 'address', 'score',
                                                'grade'], nrows = 3)
df2

    No   name  age  address  score  grade
0  NaN   name  age  address  score  grade
1  0.0  haena   30    dogok    100      A
2  1.0  naeun   27    suwon     88      B

In [110]:
to_na = {'address': ['mapo', 'NA'], 'score': [83]}
df2 = pd.read_csv('student_grade.csv', na_values = to_na)
df2

   Unnamed: 0   name  age address  score grade
0           0  haena   30   dogok  100.0     A
1           1  naeun   27   suwon   88.0     B
2           2    una   28     NaN   73.0     C
3           3    bum   23   ilsan    NaN     B
4           4   suho   18   yeoyi   95.0     A

In [113]:
df2 = pd.read_csv('student_grade.csv', skiprows = 3)
df2

   2   una  28   mapo  73  C
0  3   bum  23  ilsan  83  B
1  4  suho  18  yeoyi  95  A

In [115]:
!type student_grade1.csv

student_grade1.csv not found

In [116]:
!type /Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade1.csv

/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade1.csv not found

In [118]:
pd.read_csv('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/student_grade1.csv', sep = '|')

  ,name,age,address,score,grade
0        0,haena,30,dogok,100,A
1         1,naeun,27,suwon,88,B
2            2,una,28,mapo,73,C
3           3,bum,23,ilsan,83,B
4          4,suho,18,yeoyi,95,A

In [ ]:
# 242~243

In [3]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 12.3 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python3.11 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [4]:
# 4.4.2 이진데이터
# 엑셀파일
import pandas as pd
import numpy as np

df1 = pd.read_excel('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/shoppingcenter.xlsx')

In [5]:
df2 = pd.read_excel('shoppingcenter.xlsx') # 얜 안됨 할거면 여기에 위치한 상태로 진행해야 함

FileNotFoundError: [Errno 2] No such file or directory: 'shoppingcenter.xlsx'

In [7]:
df = pd.read_excel('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/shoppingcenter.xlsx')
df

          광역시도   시군구     업종대분류         업종중분류  1년미만  1~2년  2~3년  3~5년  5년 이상
0        서울특별시   종로구  관광/여가/오락      연극/영화/극장   1.0   2.0  42.0  39.0   16.0
1        서울특별시   종로구  관광/여가/오락         전시/관람   0.0   6.0  18.0  35.0   44.0
2        서울특별시   종로구  관광/여가/오락  PC/오락/당구/볼링등   0.0   5.0  12.0  86.0   20.0
3        서울특별시   종로구  관광/여가/오락    경마/경륜/성인오락   0.0   1.0   1.0   1.0    2.0
4        서울특별시   종로구  관광/여가/오락        스포츠/운동   0.0   0.0   1.0   0.0    0.0
...        ...   ...       ...           ...   ...   ...   ...   ...    ...
20620  제주특별자치도  서귀포시     학문/교육     학원-예능취미체육   5.0   1.0   1.0   0.0   22.0
20621  제주특별자치도  서귀포시     학문/교육     학원-보습교습입시   6.0   2.0   3.0  47.0   18.0
20622  제주특별자치도  서귀포시     학문/교육          학원기타   8.0   1.0  17.0  53.0   28.0
20623  제주특별자치도  서귀포시     학문/교육          유아교육   0.0   1.0   7.0   5.0  115.0
20624  제주특별자치도  서귀포시     학문/교육        특수교육기관   0.0   1.0   0.0   0.0    3.0

[20625 rows x 9 columns]

In [9]:
df1 = pd.read_excel('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/shoppingcenter.xlsx',
                    sheet_name = '2018년 하반기 업력현황')
df1

          광역시도   시군구     업종대분류         업종중분류  1년미만  1~2년  2~3년  3~5년  5년 이상
0        서울특별시   종로구  관광/여가/오락      연극/영화/극장     1     1    16    64     19
1        서울특별시   종로구  관광/여가/오락         전시/관람     0     0    13    45     46
2        서울특별시   종로구  관광/여가/오락  PC/오락/당구/볼링등     0     3     9    68     43
3        서울특별시   종로구  관광/여가/오락    경마/경륜/성인오락     0     1     2     0      3
4        서울특별시   종로구  관광/여가/오락        스포츠/운동     0     0     1     0      0
...        ...   ...       ...           ...   ...   ...   ...   ...    ...
20620  제주특별자치도  서귀포시     학문/교육     학원-예능취미체육     2     3     1     1     22
20621  제주특별자치도  서귀포시     학문/교육     학원-보습교습입시     3     4     3    47     18
20622  제주특별자치도  서귀포시     학문/교육          학원기타     4     4     6    64     28
20623  제주특별자치도  서귀포시     학문/교육          유아교육     0     0     3     9    115
20624  제주특별자치도  서귀포시     학문/교육        특수교육기관     0     0     1     0      3

[20625 rows x 9 columns]

In [11]:
df.to_excel('file_with_path.xlsx', sheet_name = 'Sheet1')

In [ ]:
# 253 ~ 257

In [16]:
# 4.4.4 기상청 대용량 데이터 세트의 처리

df = pd.read_csv('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/air_test.csv')
df

        site_code  test_no  average
0             104        1    0.008
1             102        8  101.000
2             102        9   64.000
3             102        6    0.071
4             102        1    0.005
...           ...      ...      ...
291595        116        3    0.021
291596        116        8   19.000
291597        124        6    0.014
291598        110        9   11.000
291599        116        6    0.025

[291600 rows x 3 columns]

In [17]:
df_chunk = pd.read_csv('/Users/raekkkky/Desktop/DNA/Semester_2023_1/Data_Analysis/data-collection-master/air_test.csv',
                       chunksize = 10000)
df_chunk

In [18]:
for chunk in df_chunk: 
    print(chunk)

      site_code  test_no  average
0           104        1    0.008
1           102        8  101.000
2           102        9   64.000
3           102        6    0.071
4           102        1    0.005
...         ...      ...      ...
9995        107        3    0.065
9996        125        9   98.000
9997        125        8  137.000
9998        125        6    0.029
9999        125        5    0.900

[10000 rows x 3 columns]
       site_code  test_no  average
10000        125        1    0.005
10001        125        3    0.050
10002        109        9   84.000
10003        109        8  114.000
10004        109        6    0.026
...          ...      ...      ...
19995        106        6    0.005
19996        106        5    0.800
19997        106        1    0.005
19998        106        3    0.058
19999        110        9   38.000

[10000 rows x 3 columns]
       site_code  test_no  average
20000        110        8   51.000
20001        110        6    0.005
20002        110        5    0.700
20003        110        1    0.008
20004        110        3    0.037
...          ...      ...      ...
29995        102        5    0.900
29996        102        3    0.059
29997        102        1    0.006
29998        102        6    0.011
29999        102        9   41.000

[10000 rows x 3 columns]
       site_code  test_no  average
30000        117        8   71.000
30001        122        9   36.000
30002        122        8   50.000
30003        122        6    0.005
30004        122        5    0.700
...          ...      ...      ...
39995        107        3    0.058
39996        125        9   65.000
39997        125        8   73.000
39998        125        6    0.022
39999        125        5    0.800

[10000 rows x 3 columns]
       site_code  test_no  average
40000        125        1    0.006
40001        125        3    0.046
40002        109        9   63.000
40003        109        8   73.000
40004        109        6    0.025
...          ...      ...      ...
49995        102        8   42.000
49996        122        9   24.000
49997        122        8   43.000
49998        122        6    0.005
49999        122        5    0.300

[10000 rows x 3 columns]
       site_code  test_no  average
50000        122        1    0.004
50001        122        3    0.052
50002        105        9   33.000
50003        105        8   46.000
50004        105        6    0.007
...          ...      ...      ...
59995        117        9   32.000
59996        117        8   41.000
59997        117        6    0.035
59998        117        5    0.400
59999        117        1    0.004

[10000 rows x 3 columns]
       site_code  test_no  average
60000        118        9   33.000
60001        122        9   29.000
60002        122        8   34.000
60003        122        6    0.032
60004        122        5    0.400
...          ...      ...      ...
69995        102        3    0.049
69996        102        1    0.004
69997        102        6    0.005
69998        102        9   22.000
69999        102        8   40.000

[10000 rows x 3 columns]
       site_code  test_no  average
70000        122        9   17.000
70001        122        8   45.000
70002        122        6    0.006
70003        122        5    0.400
70004        122        1    0.005
...          ...      ...      ...
79995        101        6    0.015
79996        101        5    0.700
79997        101        1    0.004
79998        101        3    0.035
79999        104        9   23.000

[10000 rows x 3 columns]
       site_code  test_no  average
80000        104        8   46.000
80001        104        6    0.023
80002        104        5    0.800
80003        104        1    0.006
80004        104        3    0.021
...          ...      ...      ...
89995        102        5    0.400
89996        102        3    0.017
89997        102        1    0.002
89998        102        6    0.032
89999        102        9   11.000

[10000 rows x 3 columns]
       site_code  test_no  average
90000        115        9   17.000
90001        101        9   15.000
90002        101        8   28.000
90003        101        6    0.029
90004        101        5    0.400
...          ...      ...      ...
99995        119        8   45.000
99996        119        6    0.068
99997        119        5    0.200
99998        119        1    0.004
99999        119        3    0.025

[10000 rows x 3 columns]
        site_code  test_no  average
100000        123        9   19.000
100001        123        8   33.000
100002        123        6    0.005
100003        123        5    0.500
100004        123        1    0.004
...           ...      ...      ...
109995        119        1    0.005
109996        119        3    0.037
109997        123        9   35.000
109998        123        8   40.000
109999        123        6    0.002

[10000 rows x 3 columns]
        site_code  test_no  average
110000        123        5    0.600
110001        123        1    0.007
110002        123        3    0.039
110003        124        9   30.000
110004        110        1    0.008
...           ...      ...      ...
119995        106        3    0.050
119996        115        8  110.000
119997        102        9   40.000
119998        115        9   64.000
119999        102        8   74.000

[10000 rows x 3 columns]
        site_code  test_no  average
120000        118        9   34.000
120001        122        9   36.000
120002        122        8   74.000
120003        122        6    0.003
120004        122        5    1.000
...           ...      ...      ...
129995        124        5    0.400
129996        123        3    0.015
129997        124        9   12.000
129998        124        8   31.000
129999        124        6    0.027

[10000 rows x 3 columns]
        site_code  test_no  average
130000        105        3    0.016
130001        123        9   26.000
130002        123        5    0.400
130003        101        5    0.500
130004        101        3    0.025
...           ...      ...      ...
139995        123        9   24.000
139996        119        5    0.600
139997        123        5    0.600
139998        123        6    0.002
139999        123        8   37.000

[10000 rows x 3 columns]
        site_code  test_no  average
140000        119        6    0.006
140001        124        8   42.000
140002        124        9   20.000
140003        124        6    0.002
140004        123        3    0.055
...           ...      ...      ...
149995        113        6    0.002
149996        113        8   56.000
149997        113        5    1.200
149998        113        9   23.000
149999        109        9   23.000

[10000 rows x 3 columns]
        site_code  test_no  average
150000        110        5    0.700
150001        120        3    0.052
150002        104        1    0.005
150003        104        3    0.040
150004        117        3    0.050
...           ...      ...      ...
159995        104        5    1.300
159996        104        6    0.004
159997        124        5    1.300
159998        107        6    0.002
159999        107        8  107.000

[10000 rows x 3 columns]
        site_code  test_no  average
160000        107        5    1.100
160001        107        9   78.000
160002        107        3    0.057
160003        104        3    0.052
160004        107        1    0.005
...           ...      ...      ...
169995        105        8   47.000
169996        101        1    0.004
169997        111        5    0.600
169998        105        5    0.600
169999        101        5    0.500

[10000 rows x 3 columns]
        site_code  test_no  average
170000        121        3    0.023
170001        105        6    0.018
170002        108        9   18.000
170003        117        6    0.022
170004        117        8   29.000
...           ...      ...      ...
179995        105        6    0.022
179996        109        6    0.026
179997        112        8  147.000
179998        114        5    1.100
179999        114        3    0.043

[10000 rows x 3 columns]
        site_code  test_no  average
180000        106        6    0.025
180001        125        9   68.000
180002        101        6    0.034
180003        119        1    0.004
180004        119        3    0.038
...           ...      ...      ...
189995        109        1    0.007
189996        112        6    0.002
189997        109        3    0.050
189998        112        1    0.004
189999        112        5    0.800

[10000 rows x 3 columns]
        site_code  test_no  average
190000        112        3    0.042
190001        109        8   54.000
190002        109        6    0.002
190003        109        5    0.900
190004        109        9   43.000
...           ...      ...      ...
199995        102        9   17.000
199996        115        5    0.500
199997        120        5    0.400
199998        119        9   19.000
199999        120        9   21.000

[10000 rows x 3 columns]
        site_code  test_no  average
200000        119        6    0.015
200001        119        1    0.005
200002        108        3    0.022
200003        119        8   25.000
200004        123        9   18.000
...           ...      ...      ...
209995        101        6    0.019
209996        122        9   23.000
209997        105        3    0.021
209998        104        8   63.000
209999        104        9   37.000

[10000 rows x 3 columns]
        site_code  test_no  average
210000        102        8   56.000
210001        102        9   33.000
210002        102        6    0.015
210003        102        1    0.005
210004        102        3    0.032
...           ...      ...      ...
219995        117        9   19.000
219996        118        8   44.000
219997        118        9   28.000
219998        118        6    0.019
219999        118        1    0.005

[10000 rows x 3 columns]
        site_code  test_no  average
220000        118        3    0.037
220001        118        5    0.500
220002        114        8   33.000
220003        114        9   22.000
220004        114        6    0.024
...           ...      ...      ...
229995        109        6    0.003
229996        109        8   29.000
229997        109        9   23.000
229998        113        3    0.040
229999        113        1    0.004

[10000 rows x 3 columns]
        site_code  test_no  average
230000        113        5    1.200
230001        113        6    0.003
230002        113        8   35.000
230003        113        9   23.000
230004        107        3    0.043
...           ...      ...      ...
239995        121        8   28.000
239996        122        5    0.200
239997        122        9    2.000
239998        122        6    0.021
239999        122        8   26.000

[10000 rows x 3 columns]
        site_code  test_no  average
240000        110        3    0.013
240001        110        1    0.006
240002        110        5    0.400
240003        110        6    0.018
240004        110        8   22.000
...           ...      ...      ...
249995        119        9   24.000
249996        116        3    0.057
249997        116        1    0.005
249998        116        8   32.000
249999        116        5    0.800

[10000 rows x 3 columns]
        site_code  test_no  average
250000        116        6    0.002
250001        116        9   17.000
250002        111        6    0.002
250003        111        5    0.800
250004        111        1    0.004
...           ...      ...      ...
259995        109        3    0.041
259996        109        1    0.011
259997        109        5    0.900
259998        109        6    0.019
259999        109        8   95.000

[10000 rows x 3 columns]
        site_code  test_no  average
260000        109        9   85.000
260001        103        3    0.045
260002        103        1    0.005
260003        103        5    0.800
260004        103        6    0.017
...           ...      ...      ...
269995        122        9   21.000
269996        105        1    0.015
269997        105        5    1.100
269998        108        8   54.000
269999        105        3    0.050

[10000 rows x 3 columns]
        site_code  test_no  average
270000        102        8   47.000
270001        102        9   27.000
270002        102        1    0.005
270003        102        6    0.002
270004        102        3    0.059
...           ...      ...      ...
279995        107        3    0.042
279996        107        5    0.500
279997        107        1    0.007
279998        107        6    0.002
279999        107        8   42.000

[10000 rows x 3 columns]
        site_code  test_no  average
280000        107        9   32.000
280001        103        3    0.052
280002        103        1    0.004
280003        103        5    0.800
280004        103        6    0.001
...           ...      ...      ...
289995        113        6    0.011
289996        113        8   19.000
289997        113        9   12.000
289998        109        3    0.020
289999        109        1    0.007

[10000 rows x 3 columns]
        site_code  test_no  average
290000        109        5    0.600
290001        109        6    0.017
290002        109        8   21.000
290003        109        9   13.000
290004        125        3    0.036
...           ...      ...      ...
291595        116        3    0.021
291596        116        8   19.000
291597        124        6    0.014
291598        110        9   11.000
291599        116        6    0.025

[1600 rows x 3 columns]

In [19]:
type(chunk)

pandas.core.frame.DataFrame

In [21]:
pd.concat(df_chunk, ignore_index=True) # 이거 왜 안됨?

ValueError: No objects to concatenate

In [22]:
ser1 = pd.Series(['a', 'b'])
ser2 = pd.Series(['c', 'd'])
pd.concat([ser1, ser2])

0    a
1    b
0    c
1    d
dtype: object

In [23]:
pd.concat([ser1, ser2], ignore_index=True) # 얜 되네?

0    a
1    b
2    c
3    d
dtype: object

# 이렇게 4장 끝!!